import React, { Component } from 'react'
import {MDBCardTitle, MDBBtn} from 'mdbreact';
import { MDBContainer, MDBModal, MDBModalBody, MDBModalHeader, MDBModalFooter } from 'mdbreact';



export default class Isukim extends Component {
    state = {
        modal2: false,
        modal3: false,
        modal4: false,
        modal5: false
      }
      
      
      toggle = nr => () => {
        let modalNumber = 'modal' + nr
        this.setState({
          [modalNumber]: !this.state[modalNumber]
        });
      }
    
    

    render() {
        return (
     
            <div className="isukim-section">
            


              <MDBCardTitle className="isukim-header">תחומי עיסוק</MDBCardTitle>       
              <hr style={{width:"20%"}}></hr>  
                     
                <div className="container">
                    
                    <div className="box" data-aos="fade-up">
                        <h2>01</h2>
                        <h3>דיני עבודה</h3>
                        <p>
                        משרדנו בעל מומחיות בתחום דיני העבודה והזכויות הסוציאליות של כל עובד. משרדנו מייצג מעסיקים ועובדים בהצלחה רבה והביא למימוש זכויות ותשלום כספים המגיעים לעובדים על פי דין.
                        עו"ד הנרי הלר סלמה הינו בעל ניסיון רב בייעוץ וייצוג מעסיקים ועובדים בבתי הדין לעבודה בערכאות השונות.
                  
                        </p>

                        <MDBBtn onClick={this.toggle(2)} color="warning">קרא עוד</MDBBtn>

                   

                    </div>
                    <div className="box" data-aos="fade-left">
                        <h2>02</h2>
                        <h3>נדל"ן- מקרקעין</h3>
                        <p>
                        רוכש או מוכר דירה? 
                        משרדנו זמין עבורכם בעסקאות המקרקעין השונות, ועומד לרשותכם למתן ייעוץ טרם הכניסה לעסקה החל משלב המשא ומתן ועד לרישום הזכויות.
                        משרדנו מבצע רישום בתים משותפים, רישום זכויות בטאבו ובמנהל מקרקעי ישראל, רישום הערות אזהרה ועוד.
                        </p>
                        <MDBBtn onClick={this.toggle(3)} color="warning">קרא עוד</MDBBtn>

                
                    </div>

                    <div className="box" data-aos="fade-down">
                        <h2>03</h2>
                        <h3>צוואות וירושות ייפוי כוח מתמשך ועוד</h3>
                        <p>משרדנו נותן מענה מקצועי וייצוג משפטי בכל הנוגע לצוואות, ירושות ועיזבון.
                       כמו כן, עו"ד הנרי הלר סלמה הינו מורשה ומוסמך מטעם משרד המשפטים לערוך יפוי כח מתמשך, הנחיות מקדימות לצורך מינוי אפוטרופוס ומסמך הבעת רצון על פי החוק.

                        </p>
                        <MDBBtn onClick={this.toggle(4)} color="warning">קרא עוד</MDBBtn>

                      
                    </div>

                    <div className="box" data-aos="fade-right">
                        <h2>04</h2>
                        <h3>אזרחי ומסחרי</h3>
                        <p>משרדנו בעל ניסיון רב בהקמת ובליווי חברות והתנהלות מול רשם החברות, עריכת הסכמי מייסדים ושותפים, העברת מניות, הקצעת מניות, פירוק חברות וכו'    
                             משרדנו מעניק שירות משפטי מקיף ומקצועי בבתי המשפט השונים וערכאות השונות וייצוג בסכסוכים משפטיים, יחסי ספק -לקוח, מכתבי התראה וגבייה, הוצאה לפועל, גישורים ועוד.

                        </p>

                      
                    </div>
                   
                </div>


                <MDBModal isOpen={this.state.modal2} toggle={this.toggle(2)}>
                    <MDBModalHeader toggle={this.toggle(2)}></MDBModalHeader>
                    <MDBModalBody>
                        <h3>דיני עבודה</h3>
                    משרדנו בעל מומחיות בתחום דיני העבודה והזכויות הסוציאליות של כל עובד. משרדנו מייצג מעסיקים ועובדים בהצלחה רבה והביא למימוש זכויות ותשלום כספים המגיעים לעובדים על פי דין.
                    עו"ד הנרי הלר סלמה הינו בעל ניסיון רב בייעוץ וייצוג מעסיקים ועובדים בבתי הדין לעבודה בערכאות השונות.
                    <br></br>
                    <br></br>
                    <span style={{textDecoration:"underline", fontWeight:"bolder"}}>ייצוג מעסיקים</span>
                    <br></br>
                    <br></br>
                    משרדנו מעניק ייצוג וליווי מעסיקים בכל הנוגע לייעוץ משפטי שוטף, מתן חוות דעת בנוגע לסוגיות שונות בדיני עבודה, ביצוע בדיקות ויצירת נהלים ברורים בנושא תחילתם וסיומם של יחסי העבודה, בדיקת תלושי השכר ודוחות הנוכחות של כלל  עובדי החברה והתאמתם לחוקי המגן וצווי ההרחבה השונים.
                    <br></br>
                    <br></br>
                    <span style={{textDecoration:"underline", fontWeight:"bolder"}}>ייצוג עובדים</span>
                    <br></br>
                    <br></br>
                    משרדנו מסייע ומייצג עובדים בבתי הדין לעבודה- אם לא קיבלתם את הכספים המגיעים לכם כמו אי תשלום שכר, הרעת תנאים, הלנת שכר, תשלום פיצויי פיטורים, פיטורים שלא כדין,שימוע לפני פיטורים, פיטורים בזמן מחלה, פיטורים בהריון, התפטרות עקב מעבר דירה, הפרשות לפנסיה ולקרן השתלמות, שעות נוספות דמי הבראה, דמי חופשה, ועוד.

                    
                    </MDBModalBody>
                    <MDBModalFooter>
                    <MDBBtn color="warning" onClick={this.toggle(2)}>חזור</MDBBtn>
                    </MDBModalFooter>
                 </MDBModal>

                 <MDBModal isOpen={this.state.modal3} toggle={this.toggle(3)}>
                    <MDBModalHeader toggle={this.toggle(3)}></MDBModalHeader>
                    <MDBModalBody>
                        <h3>נדל"ן- מקרקעין</h3>
                        רוכש או מוכר דירה? 
                        משרדנו זמין עבורכם בעסקאות המקרקעין השונות, ועומד לרשותכם למתן ייעוץ טרם הכניסה לעסקה החל משלב המשא ומתן ועד לרישום הזכויות.
                        משרדנו מבצע רישום בתים משותפים, רישום זכויות בטאבו ובמנהל מקרקעי ישראל, רישום הערות אזהרה ועוד.
                        כמו כן משרדנו נותן שירותי ליטיגציה בתביעות משפטיות בתחום המקרקעין לרבות פינוי שוכרים, סכסוכים בין בעלי דירות ועוד.  
                    
                    </MDBModalBody>
                    <MDBModalFooter>
                    <MDBBtn color="warning" onClick={this.toggle(3)}>חזור</MDBBtn>
                    </MDBModalFooter>
                 </MDBModal>

                 <MDBModal isOpen={this.state.modal4} toggle={this.toggle(4)}>
                    <MDBModalHeader toggle={this.toggle(4)}></MDBModalHeader>
                    <MDBModalBody>
                        <h3>צוואות וירושות ייפוי כוח מתמשך ועוד</h3>
                        משרדנו נותן מענה מקצועי וייצוג משפטי בכל הנוגע לצוואות, ירושות ועיזבון.
                        כמו כן, עו"ד הנרי הלר סלמה הינו מורשה ומוסמך מטעם משרד המשפטים לערוך יפוי כח מתמשך, הנחיות מקדימות לצורך מינוי אפוטרופוס ומסמך הבעת רצון על פי החוק.
                        <br></br>
                        <br></br>
                        <span style={{textDecoration:"underline", fontWeight:"bolder"}}>צוואות וירושות</span>
                        <br></br>
                        <br></br>
                        צוואה הינה  מסמך בעל תוקף משפטי אותו עורך המצווה, המסדיר את חלוקת הרכוש של המצווה לאחר מותו.
                        ישנה חשיבות לעריכת צוואה מקצועית על ידי עורך דין בעל ניסיון שמכיר ויודע את כל  הוראות הדין והפסיקה הקפדניות, שנועדו להבטיח שצוואה שנכתבה ע"י אדם בעודו בחיים, אכן תמומש בהתאם לרצונו.
                        <br></br>
                        <br></br>
                        <span style={{textDecoration:"underline", fontWeight:"bolder"}}>יפוי כוח מתמשך</span>
                        <br></br>
                        <br></br>
                        לאחרונה נערך שינוי חשוב בחוק וכעת ניתנת האפשרות הנפלאה לכל אדם מעל גיל 18, להחליט ולקבוע היום מי יחליט עלינו מחר, מי יטפל בנו ובענייניו הרפואיים, הכספיים והאישיים כאשר לא נוכל לעשות זאת בעצמנו. 
                        עד לשינוי החוק בעניין, כאשר אדם היה מגיע למצב המצער שהוא כבר לא יכול לדאוג לעצמו,
                        (אם בעקבות גילו המתקדם, תאונה, מחלה, מוגבלות נפשית או שכלית כגון דמנציה), על קרוביו היה לפנות באמצעות עו"ד  לבית המשפט ולבקש שימנו אותם כאפוטרופוסים על אותו אדם.
                        
                        הכלי של יפוי כח מתמשך מאפשר לנו להחליט בעוד אנו כשירים וצלולים את ההחלטות
                        החשובות ביותר – מי יטפל בנו ומי יחליט עבורנו כשלא נהיה מסוגלים לעשות זאת בעצמנו.
                        על יפויי כח מתמשך יש לחתום בפני עורך דין שעבר הכשרה מיוחדת לכך, מטעם משרד המשפטים.
                        עו"ד הנרי הלר הינו בעל ההסמכה והידע הנדרש מטעם משרד המשפטים לעריכת ייפוי כוח מתמשך.

                    
                    </MDBModalBody>
                    <MDBModalFooter>
                    <MDBBtn color="warning" onClick={this.toggle(4)}>חזור</MDBBtn>
                    </MDBModalFooter>
                 </MDBModal>
                
            </div>
  

        )
    }
}

